---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeConstraint180DegreeDefaultBend Properties
RebarShapeConstraint180DegreeDefaultBend Class See Also Send Feedback
---

The RebarShapeConstraint180DegreeDefaultBend type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RebarShapeConstraint.) |

# See Also

RebarShapeConstraint180DegreeDefaultBend Class

Autodesk.Revit.DB.Structure Namespace